DataProcessors/АК_ПлатежныйКалендарьПоРегламентнымРаботам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АК_ПлатежныйКалендарьПоРегламентнымРаботам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоНеоплаченные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоПросроченные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВалютные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоМинусоваяЭффективность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/УсловияРегламентныхРаботВТТПоТочкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УсловияРегламентныхРаботВТТПоТочкам</Name>
			<Comment>Условия регл. работ в магазинах</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозможностьОплатыДоНачала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УсловияРегламентныхРаботВТТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>УсловияРегламентныхРаботВТТ</Name>
			<Comment>Условия регл. работ в магазинах</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдинаяСтоимостьУслугиПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЧислоОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозможностьОплатыДоНачала</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыОплаты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЖурналРегламентныхРаботВМагазинах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ЖурналРегламентныхРаботВМагазинах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПредставлениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>23</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеВыполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРаботы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоФотографий</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутиКФотографиям</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнеплановаяРабота</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаВнеплановуюРаботу</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АК_ЗаявкаНаВнеплановоеОбслуживание</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРаботыСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧислоОплатыКонец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоп</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пятидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Шестидневка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ФормыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ФормыОплаты</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Наличные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Безналичные</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/АК_ПлатежныйКалендарьПоРегламентнымРаботам/Ext/ObjectModule.bsl
Перем мВалютаРегл Экспорт;

Функция	ПолучитьADOСоединение() Экспорт
	
	Возврат ВнешниеДанные.ПолучитьADOСоединение();         
	
КонецФункции

Функция ПолучитьРезультатЗапроса() 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация"			, Организация);
	Запрос.УстановитьПараметр("Контрагент"			, Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ФормаОплаты"			, ФормаОплаты);
	Запрос.УстановитьПараметр("ВалютаРегл"			, мВалютаРегл);
	
	Запрос.УстановитьПараметр("МесяцПлатежногоКалендаря"			, НачалоМесяца(НачалоПериода));
	Запрос.УстановитьПараметр("ТекущаяДата"			, НачалоДня(ТекущаяДата()));
	
	Запрос.УстановитьПараметр("МаксимальнаяДата"			, Дата(2999, 1, 1));
	Запрос.УстановитьПараметр("МинимальнаяДата"			, Дата(1, 1, 1));
	Запрос.УстановитьПараметр("ТекДата"			,ТекущаяДата());
	Запрос.УстановитьПараметр("НачалоПериода",НачалоПериода-24*3600*10);
	Запрос.УстановитьПараметр("КонецПериода",КонецПериода+24*3600*10);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УсловияРегламентныхРаботВТТПоТочкам.Контрагент,
	|	УсловияРегламентныхРаботВТТПоТочкам.Услуга,
	|	УсловияРегламентныхРаботВТТПоТочкам.ТорговаяТочка,
	|	УсловияРегламентныхРаботВТТПоТочкам.ДатаНачала,
	|	УсловияРегламентныхРаботВТТПоТочкам.ДатаОкончания,
	|	ВЫБОР
	|		КОГДА УсловияРегламентныхРаботВТТ.ЕдинаяСтоимостьУслугиПоставщика
	|			ТОГДА УсловияРегламентныхРаботВТТ.Стоимость
	|		ИНАЧЕ УсловияРегламентныхРаботВТТПоТочкам.Стоимость
	|	КОНЕЦ КАК Стоимость,
	|	ВЫБОР
	|		КОГДА УсловияРегламентныхРаботВТТПоТочкам.ЧислоОплаты = 0
	|			ТОГДА УсловияРегламентныхРаботВТТ.ЧислоОплаты
	|		ИНАЧЕ УсловияРегламентныхРаботВТТПоТочкам.ЧислоОплаты
	|	КОНЕЦ КАК ЧислоОплаты,
	|	УсловияРегламентныхРаботВТТПоТочкам.ВозможностьОплатыДоНачала,
	|	УсловияРегламентныхРаботВТТПоТочкам.Периодичность,
	|	УсловияРегламентныхРаботВТТПоТочкам.ФормаОплаты
	|ПОМЕСТИТЬ ВТ_СводнаяТаблицаУсловий
	|ИЗ
	|	РегистрСведений.УсловияРегламентныхРаботВТТПоТочкам КАК УсловияРегламентныхРаботВТТПоТочкам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УсловияРегламентныхРаботВТТ КАК УсловияРегламентныхРаботВТТ
	|		ПО УсловияРегламентныхРаботВТТПоТочкам.Контрагент = УсловияРегламентныхРаботВТТ.Контрагент
	|			И УсловияРегламентныхРаботВТТПоТочкам.Услуга = УсловияРегламентныхРаботВТТ.Услуга
	|ГДЕ
	|	УсловияРегламентныхРаботВТТПоТочкам.ДатаОкончания > НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 15), МЕСЯЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналРегламентныхРаботВМагазинах.ТорговаяТочка,
	|	ЖурналРегламентныхРаботВМагазинах.Контрагент,
	|	ЖурналРегламентныхРаботВМагазинах.Услуга,
	|	НАЧАЛОПЕРИОДА(ЖурналРегламентныхРаботВМагазинах.ДатаНачалаПериода, МЕСЯЦ) КАК МесяцОплаты,
	|	ЖурналРегламентныхРаботВМагазинах.ДатаОкончанияПериода,
	|	ЖурналРегламентныхРаботВМагазинах.Дата,
	|	ЖурналРегламентныхРаботВМагазинах.Сумма,
	|	ВТ_СводнаяТаблицаУсловий.Стоимость,
	|	ВТ_СводнаяТаблицаУсловий.ЧислоОплаты,
	|	ВТ_СводнаяТаблицаУсловий.ВозможностьОплатыДоНачала,
	|	ВТ_СводнаяТаблицаУсловий.ДатаНачала КАК ДатаНачалаДоговора,
	|	ВТ_СводнаяТаблицаУсловий.ДатаОкончания КАК ДатаОкончанияДоговора,
	|	ВТ_СводнаяТаблицаУсловий.ФормаОплаты
	|ПОМЕСТИТЬ ВТ_РаботыВПериоде
	|ИЗ
	|	РегистрСведений.ЖурналРегламентныхРаботВМагазинах КАК ЖурналРегламентныхРаботВМагазинах
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СводнаяТаблицаУсловий КАК ВТ_СводнаяТаблицаУсловий
	|		ПО ЖурналРегламентныхРаботВМагазинах.ТорговаяТочка = ВТ_СводнаяТаблицаУсловий.ТорговаяТочка
	|			И ЖурналРегламентныхРаботВМагазинах.Контрагент = ВТ_СводнаяТаблицаУсловий.Контрагент
	|			И ЖурналРегламентныхРаботВМагазинах.Услуга = ВТ_СводнаяТаблицаУсловий.Услуга
	|ГДЕ
	|	(ЖурналРегламентныхРаботВМагазинах.ДатаОкончанияПериода >= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 15), МЕСЯЦ)
	|			ИЛИ ЖурналРегламентныхРаботВМагазинах.Дата МЕЖДУ НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, 15), МЕСЯЦ) И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, -15), МЕСЯЦ))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РаботыВПериоде.ТорговаяТочка,
	|	ВТ_РаботыВПериоде.Контрагент,
	|	ВТ_РаботыВПериоде.Услуга,
	|	ВТ_РаботыВПериоде.Дата,
	|	ВТ_РаботыВПериоде.Сумма,
	|	ВТ_РаботыВПериоде.Стоимость,
	|	ВЫБОР
	|		КОГДА ВТ_РаботыВПериоде.Услуга.ФормироватьПлатежкуСразу
	|			ТОГДА ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ВТ_РаботыВПериоде.МесяцОплаты, МЕСЯЦ, -1), ДЕНЬ, ВТ_РаботыВПериоде.ЧислоОплаты - 1)
	|		ИНАЧЕ ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(ВТ_РаботыВПериоде.МесяцОплаты, МЕСЯЦ, 1), ДЕНЬ, ВТ_РаботыВПериоде.ЧислоОплаты - 1)
	|	КОНЕЦ КАК ДатаОплаты,
	|	ВТ_РаботыВПериоде.ВозможностьОплатыДоНачала,
	|	ВТ_РаботыВПериоде.ДатаНачалаДоговора,
	|	ВТ_РаботыВПериоде.ДатаОкончанияДоговора,
	|	ВТ_РаботыВПериоде.МесяцОплаты,
	|	ВТ_РаботыВПериоде.ФормаОплаты
	|ПОМЕСТИТЬ ВТ_КонечнаяРаботы
	|ИЗ
	|	ВТ_РаботыВПериоде КАК ВТ_РаботыВПериоде
	|ГДЕ
	|	(ВТ_РаботыВПериоде.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|			ИЛИ ВТ_РаботыВПериоде.ВозможностьОплатыДоНачала)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|ПОМЕСТИТЬ ВТ_ПроизводственныйКалендарь
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &НачалоПериода И &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_КонечнаяРаботы.ТорговаяТочка,
	|	ВТ_КонечнаяРаботы.Контрагент,
	|	ВТ_КонечнаяРаботы.Услуга,
	|	ВТ_КонечнаяРаботы.Дата,
	|	ВТ_КонечнаяРаботы.Сумма,
	|	ВТ_КонечнаяРаботы.Стоимость,
	|	ВТ_КонечнаяРаботы.ВозможностьОплатыДоНачала,
	|	МАКСИМУМ(ВТ_ПроизводственныйКалендарь.ДатаКалендаря) КАК ДатаОплаты,
	|	ВТ_КонечнаяРаботы.ДатаНачалаДоговора,
	|	ВТ_КонечнаяРаботы.ДатаОкончанияДоговора,
	|	ВТ_КонечнаяРаботы.МесяцОплаты,
	|	ВТ_КонечнаяРаботы.ФормаОплаты
	|ПОМЕСТИТЬ ВТ_РаботыСДатойПоКалендарю
	|ИЗ
	|	ВТ_КонечнаяРаботы КАК ВТ_КонечнаяРаботы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПроизводственныйКалендарь КАК ВТ_ПроизводственныйКалендарь
	|		ПО ВТ_КонечнаяРаботы.ДатаОплаты >= ВТ_ПроизводственныйКалендарь.ДатаКалендаря
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_КонечнаяРаботы.ВозможностьОплатыДоНачала,
	|	ВТ_КонечнаяРаботы.ТорговаяТочка,
	|	ВТ_КонечнаяРаботы.Контрагент,
	|	ВТ_КонечнаяРаботы.Услуга,
	|	ВТ_КонечнаяРаботы.Дата,
	|	ВТ_КонечнаяРаботы.Сумма,
	|	ВТ_КонечнаяРаботы.Стоимость,
	|	ВТ_КонечнаяРаботы.ДатаНачалаДоговора,
	|	ВТ_КонечнаяРаботы.ДатаОкончанияДоговора,
	|	ВТ_КонечнаяРаботы.МесяцОплаты,
	|	ВТ_КонечнаяРаботы.ФормаОплаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РаботыСДатойПоКалендарю.ТорговаяТочка КАК ТорговаяТочка,
	|	ВТ_РаботыСДатойПоКалендарю.Контрагент КАК Контрагент,
	|	ВТ_РаботыСДатойПоКалендарю.Услуга КАК Услуга,
	|	ВТ_РаботыСДатойПоКалендарю.Дата КАК Дата,
	|	ВТ_РаботыСДатойПоКалендарю.Сумма КАК СуммаПоФакту,
	|	ВТ_РаботыСДатойПоКалендарю.Стоимость КАК Сумма,
	|	ВТ_РаботыСДатойПоКалендарю.ВозможностьОплатыДоНачала КАК ВозможностьОплатыДоНачала,
	|	ВТ_РаботыСДатойПоКалендарю.ДатаОплаты КАК ДатаОплаты,
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	|	ВТ_РаботыСДатойПоКалендарю.МесяцОплаты КАК МесяцОплаты,
	|	ВТ_РаботыСДатойПоКалендарю.ДатаНачалаДоговора КАК ДатаНачалаДоговора,
	|	ВТ_РаботыСДатойПоКалендарю.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	ДоговорыКонтрагентов.Организация,
	|	ВТ_РаботыСДатойПоКалендарю.ФормаОплаты
	|ПОМЕСТИТЬ ВТ_РаботыСДоговорами
	|ИЗ
	|	ВТ_РаботыСДатойПоКалендарю КАК ВТ_РаботыСДатойПоКалендарю
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВТ_РаботыСДатойПоКалендарю.Контрагент = ДоговорыКонтрагентов.Владелец
	|			И ВТ_РаботыСДатойПоКалендарю.Услуга = ДоговорыКонтрагентов.Номенклатура
	|			И (ДоговорыКонтрагентов.СрокДействия = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ ВТ_РаботыСДатойПоКалендарю.МесяцОплаты < ДоговорыКонтрагентов.СрокДействия)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НАЧАЛОПЕРИОДА(РасходИзБанкаСтруктурныеЕдиницы.Ссылка.ПериодРегистрации, МЕСЯЦ) КАК МесяцОплаты,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные) КАК ФормаОплаты,
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка КАК ПлатежныйДокумент,
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка.ДатаОплаты КАК ДатаОплаты,
	|	РасходИзБанкаСтруктурныеЕдиницы.Сумма,
	|	ВЫБОР
	|		КОГДА РасходИзБанкаСтруктурныеЕдиницы.Ссылка.Проведен
	|				И РасходИзБанкаСтруктурныеЕдиницы.Ссылка.Оплачено
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДокументПроведен,
	|	РасходИзБанкаСтруктурныеЕдиницы.СтруктурнаяЕдиница
	|ПОМЕСТИТЬ ВТ_ПлатежныеДокументыПредварительно
	|ИЗ
	|	Документ.РасходИзБанка.СтруктурныеЕдиницы КАК РасходИзБанкаСтруктурныеЕдиницы
	|ГДЕ
	|	РасходИзБанкаСтруктурныеЕдиницы.Ссылка.ДоговорКонтрагента В
	|			(ВЫБРАТЬ
	|				ВТ_РаботыСДоговорами.ДоговорКонтрагента
	|			ИЗ
	|				ВТ_РаботыСДоговорами)
	|	И РасходИзБанкаСтруктурныеЕдиницы.Ссылка.Проведен = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасходИзКассыСтруктурныеЕдиницы.Ссылка.ДоговорКонтрагента,
	|	НАЧАЛОПЕРИОДА(РасходИзКассыСтруктурныеЕдиницы.Ссылка.ПериодРегистрации, МЕСЯЦ),
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные),
	|	РасходИзКассыСтруктурныеЕдиницы.Ссылка,
	|	НАЧАЛОПЕРИОДА(РасходИзКассыСтруктурныеЕдиницы.Ссылка.Дата, ДЕНЬ),
	|	РасходИзКассыСтруктурныеЕдиницы.Сумма,
	|	РасходИзКассыСтруктурныеЕдиницы.Ссылка.Проведен,
	|	РасходИзКассыСтруктурныеЕдиницы.СтруктурнаяЕдиница
	|ИЗ
	|	Документ.РасходИзКассы.СтруктурныеЕдиницы КАК РасходИзКассыСтруктурныеЕдиницы
	|ГДЕ
	|	РасходИзКассыСтруктурныеЕдиницы.Ссылка.ДоговорКонтрагента В
	|			(ВЫБРАТЬ
	|				ВТ_РаботыСДоговорами.ДоговорКонтрагента
	|			ИЗ
	|				ВТ_РаботыСДоговорами)
	|	И РасходИзКассыСтруктурныеЕдиницы.Ссылка.Проведен = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_РаботыСДоговорами.ТорговаяТочка КАК ТорговаяТочка,
	|	ВТ_РаботыСДоговорами.Контрагент КАК Контрагент,
	|	ВТ_РаботыСДоговорами.Услуга КАК Услуга,
	|	ВТ_РаботыСДоговорами.Дата КАК Дата,
	|	ВТ_РаботыСДоговорами.СуммаПоФакту КАК СуммаПоФакту,
	|	ВТ_РаботыСДоговорами.Сумма КАК Сумма,
	|	ВТ_РаботыСДоговорами.ВозможностьОплатыДоНачала КАК ВозможностьОплатыДоНачала,
	|	ВТ_РаботыСДоговорами.ДатаОплаты КАК ДатаОплаты,
	|	ВТ_РаботыСДоговорами.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_РаботыСДоговорами.МесяцОплаты КАК МесяцОплаты,
	|	ВТ_РаботыСДоговорами.ДатаНачалаДоговора КАК ДатаНачалаДоговора,
	|	ВТ_РаботыСДоговорами.ДатаОкончанияДоговора КАК ДатаОкончанияДоговора,
	|	ВТ_РаботыСДоговорами.ДоговорКонтрагента.Организация КАК Организация,
	|	ВТ_ПлатежныеДокументыПредварительно.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|	ВТ_ПлатежныеДокументыПредварительно.ДатаОплаты КАК ДатаОплатыФакт,
	|	ВТ_ПлатежныеДокументыПредварительно.Сумма КАК СуммаОплаты,
	|	ВТ_ПлатежныеДокументыПредварительно.ДокументПроведен КАК ДокументПроведен,
	|	ВТ_ПлатежныеДокументыПредварительно.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_РаботыСДоговорами.ФормаОплаты КАК ФормаОплаты,
	|	ВТ_РаботыСДоговорами.ДоговорКонтрагента.СтавкаНДС КАК СтавкаНДС
	|ИЗ
	|	ВТ_РаботыСДоговорами КАК ВТ_РаботыСДоговорами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПлатежныеДокументыПредварительно КАК ВТ_ПлатежныеДокументыПредварительно
	|		ПО ВТ_РаботыСДоговорами.ТорговаяТочка = ВТ_ПлатежныеДокументыПредварительно.СтруктурнаяЕдиница
	|			И ВТ_РаботыСДоговорами.ДоговорКонтрагента = ВТ_ПлатежныеДокументыПредварительно.ДоговорКонтрагента
	|			И ВТ_РаботыСДоговорами.МесяцОплаты = ВТ_ПлатежныеДокументыПредварительно.МесяцОплаты
	|			И ВТ_РаботыСДоговорами.ФормаОплаты = ВТ_ПлатежныеДокументыПредварительно.ФормаОплаты
	|ГДЕ
	|	НЕ ВТ_РаботыСДоговорами.ДоговорКонтрагента.ПометкаУдаления
	|	И (КОНЕЦПЕРИОДА(ВТ_РаботыСДоговорами.МесяцОплаты, МЕСЯЦ) < КОНЕЦПЕРИОДА(&ТекДата, МЕСЯЦ)
	|			ИЛИ ВТ_РаботыСДоговорами.Услуга.ФормироватьПлатежкуСразу)";
	
	Возврат Запрос.Выполнить();

КонецФункции

Функция ПолучитьРезультатТаблицу() Экспорт 
	
	РезультатЗапроса = ПолучитьРезультатЗапроса();
	
	ТаблицаРезультат = РезультатЗапроса.Выгрузить().СкопироватьКолонки();
	ТаблицаРезультат.Колонки.Добавить("ЕстьРасчетыВВалюте", Новый ОписаниеТипов("Булево"));
	
	ВыборкаДоговоры = РезультатЗапроса.Выбрать();
		
	Пока ВыборкаДоговоры.Следующий() Цикл
		
		//ВыборкаФормыОплаты = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//
		//Пока ВыборкаФормыОплаты.Следующий() Цикл
		//
		//	//ВыборкаТипАренднойПлаты = ВыборкаФормыОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//
		//	//Пока ВыборкаТипАренднойПлаты.Следующий() Цикл
		//	
		//		ВыборкаМесяцАренды = ВыборкаФормыОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		//
		//		Пока ВыборкаМесяцАренды.Следующий() Цикл
					
					НСтрока = ТаблицаРезультат.Добавить();
					ЗаполнитьЗначенияСвойств(НСтрока, ВыборкаДоговоры);
					
					//Сумма = 0;
					//Выборка = ВыборкаМесяцАренды.Выбрать();
					//
					//Пока Выборка.Следующий()  Цикл
					//	
					//	//Если Выборка.ВалютаСтрока = мВалютаРегл Тогда
					//		Сумма = Сумма + Выборка.Сумма; 
					//		
					//	//ИначеЕсли ЗначениеЗаполнено(Выборка.ВалютаСтрока) Тогда
					//	//	КурсВалюты =  РегистрыСведений.КурсыВалют.ПолучитьПоследнее(Выборка.ДатаОплаты, Новый Структура("Валюта", Выборка.ВалютаСтрока)).Курс;
					//	//	Сумма = Сумма + Выборка.СуммаВал*КурсВалюты; 
					//	//	НСтрока.ЕстьРасчетыВВалюте = Истина;
					//	//	
					//	//ИначеЕсли Выборка.Валюта = мВалютаРегл И (Выборка.СпособРасчета = Перечисления.СпособыРасчетаКурсаВалюты.КурсЦБ ИЛИ Выборка.СпособРасчета = Перечисления.СпособыРасчетаКурсаВалюты.ПустаяСсылка()) Тогда
					//	//	Сумма = Сумма + Выборка.Сумма; 
					//	//	
					//	//Иначе
					//	//	КурсВалюты = ПроцедурыНачисления.ПолучитьКурсВалютыПоДоговору(Выборка.ДатаОплаты, Выборка).Курс;	
					//	//	Сумма = Сумма + Выборка.СуммаВал*КурсВалюты; 
					//	//	НСтрока.ЕстьРасчетыВВалюте = Истина;
					//	//	
					//	//КонецЕсли;
					//	
					//КонецЦикла; 
					//
					//НСтрока.Сумма = Сумма;
					
		//		КонецЦикла; 

		////	КонецЦикла; 

		//КонецЦикла; 
		
	КонецЦикла;
	
	//
	Возврат ТаблицаРезультат;
	
КонецФункции



Функция ПолучитьРезультатЗапросаСтарыйВариант() 

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода"		, НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода"		, КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("НачалоСледПериода"	, ДобавитьМесяц(НачалоПериода, 1));
	Запрос.УстановитьПараметр("КонецСледПериода"	, КонецМесяца(ДобавитьМесяц(КонецПериода, 1)));
	Запрос.УстановитьПараметр("Организация"			, Организация);
	Запрос.УстановитьПараметр("Контрагент"			, Контрагент);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"	, СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("ТекущаяДата"			, НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ФормаОплаты"			, ФормаОплаты);
	Запрос.УстановитьПараметр("ВидПериода"			, ВидПериода);
	Запрос.УстановитьПараметр("ДатаОтчета"			, ДатаОтчета);
	Запрос.УстановитьПараметр("ВалютаРегл"			, мВалютаРегл);
	Запрос.УстановитьПараметр("Руб"					, Справочники.Валюты.НайтиПоНаименованию("RUB"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря КАК ДатаКалендаря,
	|	СтатусыДоговоровАренды.Договор КАК ДоговорКонтрагента,
	|	МАКСИМУМ(СтатусыДоговоровАренды.Период) КАК Период
	|ПОМЕСТИТЬ ВТПроизводственныйКалендарь
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДоговоровАренды КАК СтатусыДоговоровАренды
	|		ПО (СтатусыДоговоровАренды.Период <= РегламентированныйПроизводственныйКалендарь.ДатаКалендаря)
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &НачалоПериода
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &КонецПериода
	|	И (СтатусыДоговоровАренды.Договор.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И (СтатусыДоговоровАренды.Договор.Владелец = &Контрагент
	|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	И (СтатусыДоговоровАренды.Договор.ОбъектАренды.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|			ИЛИ &СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|	И СтатусыДоговоровАренды.ЗаключениеДоговора.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийДоговоровАренды.САрендодателем)
	|	И НЕ СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
	|	И НЕ НАЧАЛОПЕРИОДА(СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта, МЕСЯЦ) > &НачалоПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря,
	|	СтатусыДоговоровАренды.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СтатусыДоговоровАренды.Договор.Организация КАК Организация,
	|	СтатусыДоговоровАренды.Договор.Владелец КАК Контрагент,
	|	СтатусыДоговоровАренды.Договор КАК ДоговорКонтрагента,
	|	СтатусыДоговоровАренды.Договор.ОбъектАренды.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВЫБОР
	|		КОГДА СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта = ДАТАВРЕМЯ(1, 1, 1)
	|				ИЛИ СтатусыДоговоровАренды.ДатаНачалаАренды > СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта
	|			ТОГДА СтатусыДоговоровАренды.ДатаНачалаАренды
	|		ИНАЧЕ СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта
	|	КОНЕЦ КАК ДатаНачалаАренды,
	|	СтатусыДоговоровАренды.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта КАК ДатаАктаЗаключения,
	|	ВЫБОР
	|		КОГДА СтатусыДоговоровАренды.Регистратор ССЫЛКА Документ.РасторжениеДоговораАренды
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ДоговорРасторгнут,
	|	МАКСИМУМ(РегламентированныйПроизводственныйКалендарь2.ДатаКалендаря) КАК ДатаОплаты
	|ПОМЕСТИТЬ ВТ_Статусы
	|ИЗ
	|	ВТПроизводственныйКалендарь КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДоговоровАренды КАК СтатусыДоговоровАренды
	|		ПО ВложенныйЗапрос.ДоговорКонтрагента = СтатусыДоговоровАренды.Договор
	|			И ВложенныйЗапрос.Период = СтатусыДоговоровАренды.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь2
	|		ПО (РегламентированныйПроизводственныйКалендарь2.ДатаКалендаря <= ДОБАВИТЬКДАТЕ(&НачалоПериода, ДЕНЬ, ВложенныйЗапрос.ДоговорКонтрагента.ЧислоОплатыАренды - 1))
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь2.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|	И РегламентированныйПроизводственныйКалендарь2.ДатаКалендаря <= ДОБАВИТЬКДАТЕ(&КонецПериода, МЕСЯЦ, 1)
	|	И ВложенныйЗапрос.ДатаКалендаря = НАЧАЛОПЕРИОДА(&КонецПериода, ДЕНЬ)
	|
	|СГРУППИРОВАТЬ ПО
	|	СтатусыДоговоровАренды.Договор.Организация,
	|	СтатусыДоговоровАренды.Договор.Владелец,
	|	СтатусыДоговоровАренды.Договор,
	|	СтатусыДоговоровАренды.Договор.ОбъектАренды.СтруктурнаяЕдиница,
	|	СтатусыДоговоровАренды.ДатаНачалаАренды,
	|	СтатусыДоговоровАренды.ДатаОкончанияАренды,
	|	СтатусыДоговоровАренды.ЗаключениеДоговора.ДатаАкта,
	|	ВЫБОР
	|		КОГДА СтатусыДоговоровАренды.Регистратор ССЫЛКА Документ.РасторжениеДоговораАренды
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	РегламентированныйПроизводственныйКалендарь.ДатаКалендаря
	|ПОМЕСТИТЬ ВТ_ПервыйРабочийДень
	|ИЗ
	|	РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
	|ГДЕ
	|	РегламентированныйПроизводственныйКалендарь.ВидДня В (ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий), ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Предпраздничный))
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря >= &НачалоПериода
	|	И РегламентированныйПроизводственныйКалендарь.ДатаКалендаря <= &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|	ВложенныйЗапрос.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|	ВложенныйЗапрос.ДатаАктаЗаключения КАК ДатаАктаЗаключения,
	|	ВложенныйЗапрос.ДоговорРасторгнут КАК ДоговорРасторгнут,
	|	ВЫБОР
	|		КОГДА НЕ ДатыОплатыПоДоговорамАренды.Дата ЕСТЬ NULL 
	|			ТОГДА ДатыОплатыПоДоговорамАренды.Дата
	|		КОГДА МЕСЯЦ(ВложенныйЗапрос.ДатаОплаты) < МЕСЯЦ(&НачалоПериода)
	|			ТОГДА ВТ_ПервыйРабочийДень.ДатаКалендаря
	|		ИНАЧЕ ВложенныйЗапрос.ДатаОплаты
	|	КОНЕЦ КАК ДатаОплаты,
	|	ВложенныйЗапрос2.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|	ВложенныйЗапрос2.ФормаОплаты КАК ФормаОплаты,
	|	ВЫБОР
	|		КОГДА СтатусыОплатыПоДоговорамАрендыСрезПоследних.Статус ЕСТЬ NULL 
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОплатыДоговоровКонтрагентов.Действует)
	|		ИНАЧЕ СтатусыОплатыПоДоговорамАрендыСрезПоследних.Статус
	|	КОНЕЦ КАК СтатусОплаты
	|ПОМЕСТИТЬ ВТ_Договоры
	|ИЗ
	|	ВТ_ПервыйРабочийДень КАК ВТ_ПервыйРабочийДень,
	|	ВТ_Статусы КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДатыОплатыПоДоговорамАренды КАК ДатыОплатыПоДоговорамАренды
	|		ПО ВложенныйЗапрос.ДоговорКонтрагента = ДатыОплатыПоДоговорамАренды.Договор
	|			И (ДатыОплатыПоДоговорамАренды.ПериодРегистрации = &НачалоПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОплатыПоДоговорамАренды.СрезПоследних(&КонецПериода, ) КАК СтатусыОплатыПоДоговорамАрендыСрезПоследних
	|		ПО ВложенныйЗапрос.ДоговорКонтрагента = СтатусыОплатыПоДоговорамАрендыСрезПоследних.Договор,
	|	(ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть) КАК ТипАренднойПлаты,
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные) КАК ФормаОплаты
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть),
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть),
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть),
	|		ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)) КАК ВложенныйЗапрос2
	|ГДЕ
	|	ВЫБОР
	|			КОГДА МЕСЯЦ(ВложенныйЗапрос.ДатаОплаты) < МЕСЯЦ(&НачалоПериода)
	|				ТОГДА ВТ_ПервыйРабочийДень.ДатаКалендаря
	|			ИНАЧЕ ВложенныйЗапрос.ДатаОплаты
	|		КОНЕЦ >= &НачалоПериода
	|	И ВЫБОР
	|			КОГДА МЕСЯЦ(ВложенныйЗапрос.ДатаОплаты) < МЕСЯЦ(&НачалоПериода)
	|				ТОГДА ВТ_ПервыйРабочийДень.ДатаКалендаря
	|			ИНАЧЕ ВложенныйЗапрос.ДатаОплаты
	|		КОНЕЦ <= &КонецПериода
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланируемыеПлатежиПоДоговорамАренды.Договор КАК ДоговорКонтрагента,
	|	ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАренды.Сумма) КАК СуммаПлан,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАренды.СуммаВал) КАК СуммаПланВал
	|ПОМЕСТИТЬ ВТ_ПланируемыеПлатежи
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды КАК ПланируемыеПлатежиПоДоговорамАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(ПланируемыеПлатежиПоДоговорамАренды.Период) КАК Период,
	|				ПланируемыеПлатежиПоДоговорамАренды.Договор КАК Договор,
	|				ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты КАК ФормаОплаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.Дата КАК Дата
	|			ИЗ
	|				РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды КАК ПланируемыеПлатежиПоДоговорамАренды
	|			ГДЕ
	|				ПланируемыеПлатежиПоДоговорамАренды.Период <= &КонецПериода
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ПланируемыеПлатежиПоДоговорамАренды.Договор,
	|				ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.Дата) КАК Периоды
	|			ПО ПланируемыеПлатежиПоДоговорамАренды.Период = Периоды.Период
	|				И ПланируемыеПлатежиПоДоговорамАренды.Договор = Периоды.Договор
	|				И ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты = Периоды.ФормаОплаты
	|				И ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты = Периоды.ТипАренднойПлаты
	|				И ПланируемыеПлатежиПоДоговорамАренды.Дата = Периоды.Дата
	|		ПО ВТ_Договоры.ДоговорКонтрагента = ПланируемыеПлатежиПоДоговорамАренды.Договор
	|			И ВТ_Договоры.ФормаОплаты = ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты
	|ГДЕ
	|	ПланируемыеПлатежиПоДоговорамАренды.Период <= &КонецПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата >= &НачалоПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата <= &КонецПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата >= ВТ_Договоры.ДатаНачалаАренды
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата <= ВЫБОР
	|			КОГДА ВТ_Договоры.ДоговорРасторгнут
	|				ТОГДА ВТ_Договоры.ДатаОкончанияАренды
	|			ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОкончанияАренды, МЕСЯЦ, 6), МЕСЯЦ)
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланируемыеПлатежиПоДоговорамАренды.Договор,
	|	ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланируемыеПлатежиПоДоговорамАренды.Договор КАК ДоговорКонтрагента,
	|	ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАренды.Сумма) КАК СуммаПлан,
	|	СУММА(ПланируемыеПлатежиПоДоговорамАренды.СуммаВал) КАК СуммаПланВал
	|ПОМЕСТИТЬ ВТ_ПланируемыеПлатежи_СледующийПериод
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды КАК ПланируемыеПлатежиПоДоговорамАренды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				МАКСИМУМ(ПланируемыеПлатежиПоДоговорамАренды.Период) КАК Период,
	|				ПланируемыеПлатежиПоДоговорамАренды.Договор КАК Договор,
	|				ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты КАК ФормаОплаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.Дата КАК Дата
	|			ИЗ
	|				РегистрСведений.ПланируемыеПлатежиПоДоговорамАренды КАК ПланируемыеПлатежиПоДоговорамАренды
	|			ГДЕ
	|				ПланируемыеПлатежиПоДоговорамАренды.Период <= &КонецСледПериода
	|			
	|			СГРУППИРОВАТЬ ПО
	|				ПланируемыеПлатежиПоДоговорамАренды.Договор,
	|				ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты,
	|				ПланируемыеПлатежиПоДоговорамАренды.Дата) КАК Периоды
	|			ПО ПланируемыеПлатежиПоДоговорамАренды.Период = Периоды.Период
	|				И ПланируемыеПлатежиПоДоговорамАренды.Договор = Периоды.Договор
	|				И ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты = Периоды.ФормаОплаты
	|				И ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты = Периоды.ТипАренднойПлаты
	|				И ПланируемыеПлатежиПоДоговорамАренды.Дата = Периоды.Дата
	|		ПО ВТ_Договоры.ДоговорКонтрагента = ПланируемыеПлатежиПоДоговорамАренды.Договор
	|			И ВТ_Договоры.ФормаОплаты = ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты
	|ГДЕ
	|	ПланируемыеПлатежиПоДоговорамАренды.Период <= &КонецСледПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата >= &НачалоСледПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата <= &КонецСледПериода
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата >= ВТ_Договоры.ДатаНачалаАренды
	|	И ПланируемыеПлатежиПоДоговорамАренды.Дата <= ВЫБОР
	|			КОГДА ВТ_Договоры.ДоговорРасторгнут
	|				ТОГДА ВТ_Договоры.ДатаОкончанияАренды
	|			ИНАЧЕ КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОкончанияАренды, МЕСЯЦ, 6), МЕСЯЦ)
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ПланируемыеПлатежиПоДоговорамАренды.Договор,
	|	ПланируемыеПлатежиПоДоговорамАренды.ФормаОплаты,
	|	ПланируемыеПлатежиПоДоговорамАренды.ТипАренднойПлаты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходИзБанка.Организация КАК Организация,
	|	РасходИзБанка.Контрагент КАК Контрагент,
	|	РасходИзБанка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	НАЧАЛОПЕРИОДА(РасходИзБанка.Ссылка.Дата, ДЕНЬ) КАК Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные) КАК ФормаОплаты,
	|	ВЫБОР
	|		КОГДА РасходИзБанка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть)
	|	КОНЕЦ КАК ТипАренднойПлаты,
	|	РасходИзБанка.Ссылка КАК ПлатежныйДокумент
	|ПОМЕСТИТЬ ВТДокументыРасхода
	|ИЗ
	|	Документ.РасходИзБанка КАК РасходИзБанка
	|ГДЕ
	|	РасходИзБанка.Проведен
	|	И РасходИзБанка.Дата >= &НачалоПериода
	|	И РасходИзБанка.Дата <= ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|	И (РасходИзБанка.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И (РасходИзБанка.Контрагент = &Контрагент
	|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	И РасходИзБанка.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПостояннойЧастиАрендыАрендодателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийППИсходящее.ОплатаПеременнойЧастиАрендыАрендодателю))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	NULL,
	|	NULL,
	|	NULL,
	|	РасходИзКассы.Ссылка.Дата,
	|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные),
	|	ВЫБОР
	|		КОГДА РасходИзКассы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПостояннаяЧасть)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыАренднойПлаты.ПеременнаяЧасть)
	|	КОНЕЦ,
	|	РасходИзКассы.Ссылка
	|ИЗ
	|	Документ.РасходИзКассы КАК РасходИзКассы
	|ГДЕ
	|	РасходИзКассы.Проведен
	|	И РасходИзКассы.Дата >= &НачалоПериода
	|	И РасходИзКассы.Дата <= ДОБАВИТЬКДАТЕ(&КонецПериода, ДЕНЬ, 1)
	|	И (РасходИзКассы.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|	И (РасходИзКассы.Контрагент = &Контрагент
	|			ИЛИ &Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|	И РасходИзКассы.ВидОперации В (ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПостояннойЧастиАрендыАрендодателю), ЗНАЧЕНИЕ(Перечисление.ВидыОперацийРКО.ОплатаПеременнойЧастиАрендыАрендодателю))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Договоры.Организация КАК Организация,
	|	ВТ_Договоры.Контрагент КАК Контрагент,
	|	ВТ_Договоры.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ВТ_Договоры.ДоговорКонтрагента.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_Договоры.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВТ_Договоры.ДатаНачалаАренды,
	|	ВТ_Договоры.ДатаОкончанияАренды,
	|	ВТ_Договоры.ДатаАктаЗаключения,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|							ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПлан, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПлан, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПланБезналичные,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|							ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПланВал, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПланВал, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПланБезналичныеВал,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|							ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПлан, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПлан, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПланНаличные,
	|	СУММА(ВЫБОР
	|			КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|				ТОГДА ВЫБОР
	|						КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|							ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПланВал, 0)
	|						ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПланВал, 0)
	|					КОНЕЦ
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаПланНаличныеВал,
	|	ВТ_Договоры.ДатаОплаты КАК ДатаОплаты,
	|	ВТ_Договоры.ДоговорКонтрагента.Комментарий КАК Комментарий,
	|	ВТ_Договоры.ДоговорКонтрагента.ЧислоОплатыАренды КАК ЧислоОплатыАренды,
	|	ВТ_Договоры.ДоговорКонтрагента.СрокОплатыАренды КАК СрокОплатыАренды,
	|	ВТ_Договоры.СтатусОплаты,
	|	ВТ_Договоры.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|			ТОГДА Документы.ПлатежныйДокумент
	|		ИНАЧЕ Документы.ПлатежныйДокумент
	|	КОНЕЦ КАК ПлатежныйДокумент,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|				И НЕ Документы.Дата ЕСТЬ NULL 
	|				И ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОплаты, ДЕНЬ, 1) = Документы.Дата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоХвостОплаты
	|ПОМЕСТИТЬ ВТ_СводныеДанные
	|ИЗ
	|	ВТ_Договоры КАК ВТ_Договоры
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланируемыеПлатежи КАК ВТ_ПланируемыеПлатежи
	|		ПО ВТ_Договоры.ДоговорКонтрагента = ВТ_ПланируемыеПлатежи.ДоговорКонтрагента
	|			И ВТ_Договоры.ФормаОплаты = ВТ_ПланируемыеПлатежи.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = ВТ_ПланируемыеПлатежи.ТипАренднойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПланируемыеПлатежи_СледующийПериод КАК ВТ_ПланируемыеПлатежи_СледующийПериод
	|		ПО ВТ_Договоры.ДоговорКонтрагента = ВТ_ПланируемыеПлатежи_СледующийПериод.ДоговорКонтрагента
	|			И ВТ_Договоры.ФормаОплаты = ВТ_ПланируемыеПлатежи_СледующийПериод.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = ВТ_ПланируемыеПлатежи_СледующийПериод.ТипАренднойПлаты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТДокументыРасхода КАК Документы
	|		ПО ВТ_Договоры.Организация = Документы.Организация
	|			И ВТ_Договоры.Контрагент = Документы.Контрагент
	|			И ВТ_Договоры.ДоговорКонтрагента = Документы.ДоговорКонтрагента
	|			И (ВТ_Договоры.ДатаОплаты = Документы.Дата
	|				ИЛИ ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|					И ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОплаты, ДЕНЬ, 1) = Документы.Дата)
	|			И ВТ_Договоры.ФормаОплаты = Документы.ФормаОплаты
	|			И ВТ_Договоры.ТипАренднойПлаты = Документы.ТипАренднойПлаты
	|ГДЕ
	|	(ВТ_Договоры.ФормаОплаты = &ФормаОплаты
	|			ИЛИ &ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка)
	|				И ВЫБОР
	|					КОГДА НЕ &ВидПериода
	|							И ВТ_Договоры.ДатаОплаты = &ДатаОтчета
	|						ТОГДА 1
	|					КОГДА &ВидПериода
	|						ТОГДА 1
	|					ИНАЧЕ 0
	|				КОНЕЦ = 1)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Договоры.ДоговорКонтрагента,
	|	ВТ_Договоры.Организация,
	|	ВТ_Договоры.Контрагент,
	|	ВТ_Договоры.СтруктурнаяЕдиница,
	|	ВТ_Договоры.ДатаНачалаАренды,
	|	ВТ_Договоры.ДатаОкончанияАренды,
	|	ВТ_Договоры.ДатаАктаЗаключения,
	|	ВТ_Договоры.ДоговорКонтрагента.СтавкаНДС,
	|	ВТ_Договоры.ДатаОплаты,
	|	ВТ_Договоры.ДоговорКонтрагента.Комментарий,
	|	ВТ_Договоры.ДоговорКонтрагента.ЧислоОплатыАренды,
	|	ВТ_Договоры.ДоговорКонтрагента.СрокОплатыАренды,
	|	ВТ_Договоры.СтатусОплаты,
	|	ВТ_Договоры.ТипАренднойПлаты,
	|	Документы.ПлатежныйДокумент,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|			ТОГДА Документы.ПлатежныйДокумент
	|		ИНАЧЕ Документы.ПлатежныйДокумент
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Следующий)
	|				И НЕ Документы.Дата ЕСТЬ NULL 
	|				И ДОБАВИТЬКДАТЕ(ВТ_Договоры.ДатаОплаты, ДЕНЬ, 1) = Документы.Дата
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|
	|ИМЕЮЩИЕ
	|	(СУММА(ВЫБОР
	|				КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|								ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПлан, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПлан, 0)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Безналичные)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|								ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПланВал, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПланВал, 0)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|								ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПлан, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПлан, 0)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0
	|		ИЛИ СУММА(ВЫБОР
	|				КОГДА ВТ_Договоры.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.Наличные)
	|					ТОГДА ВЫБОР
	|							КОГДА ВТ_Договоры.ДоговорКонтрагента.ПериодОплатыАренды = ЗНАЧЕНИЕ(Перечисление.ВидыПериодовОплатыАренды.Текущий)
	|								ТОГДА ЕСТЬNULL(ВТ_ПланируемыеПлатежи.СуммаПланВал, 0)
	|							ИНАЧЕ ЕСТЬNULL(ВТ_ПланируемыеПлатежи_СледующийПериод.СуммаПланВал, 0)
	|						КОНЕЦ
	|				ИНАЧЕ 0
	|			КОНЕЦ) <> 0)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.ДоговорКонтрагента,
	|	ВложенныйЗапрос.СтавкаНДС,
	|	ВложенныйЗапрос.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.ДатаНачалаАренды,
	|	ВложенныйЗапрос.ДатаОкончанияАренды,
	|	ВложенныйЗапрос.ДатаАктаЗаключения,
	|	ВложенныйЗапрос.СуммаПланБезналичные,
	|	ВЫБОР
	|		КОГДА КурсыВалютДляРасчетовПоАренде.Валюта = &ВалютаРегл
	|					И КурсыВалютДляРасчетовПоАренде.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.КурсЦБ)
	|				ИЛИ ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.СпособРасчета, ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.ПустаяСсылка)) = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.ПустаяСсылка)
	|			ТОГДА ВложенныйЗапрос.СуммаПланБезналичные
	|		ИНАЧЕ ВложенныйЗапрос.СуммаПланБезналичныеВал
	|	КОНЕЦ КАК СуммаПланБезналичныеВал,
	|	ВложенныйЗапрос.СуммаПланНаличные,
	|	ВЫБОР
	|		КОГДА КурсыВалютДляРасчетовПоАренде.Валюта = &ВалютаРегл
	|				И КурсыВалютДляРасчетовПоАренде.СпособРасчета = ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.КурсЦБ)
	|			ТОГДА ВложенныйЗапрос.СуммаПланНаличные
	|		ИНАЧЕ ВложенныйЗапрос.СуммаПланНаличныеВал
	|	КОНЕЦ КАК СуммаПланНаличныеВал,
	|	ВложенныйЗапрос.ДатаОплаты,
	|	ВложенныйЗапрос.Комментарий,
	|	ВложенныйЗапрос.ЧислоОплатыАренды,
	|	ВложенныйЗапрос.СрокОплатыАренды,
	|	ВложенныйЗапрос.СтатусОплаты,
	|	ВложенныйЗапрос.ТипАренднойПлаты,
	|	ВложенныйЗапрос.ПлатежныйДокумент,
	|	ВложенныйЗапрос.ЭтоХвостОплаты,
	|	ВложенныйЗапрос.Период,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Валюта, &Руб) КАК Валюта,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Валюта2, &Руб) КАК Валюта2,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Курс, 1) КАК Курс,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.Кратность, &Руб) КАК Кратность,
	|	ЕСТЬNULL(КурсыВалютДляРасчетовПоАренде.СпособРасчета, ЗНАЧЕНИЕ(Перечисление.СпособыРасчетаКурсаВалюты.ПустаяСсылка)) КАК СпособРасчета,
	|	КурсыВалютДляРасчетовПоАренде.Коэффициент,
	|	КурсыВалютДляРасчетовПоАренде.НижняяГраница,
	|	КурсыВалютДляРасчетовПоАренде.ВерхняяГраница
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ_СводныеДанные.Организация КАК Организация,
	|		ВТ_СводныеДанные.Контрагент КАК Контрагент,
	|		ВТ_СводныеДанные.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|		ВТ_СводныеДанные.СтавкаНДС КАК СтавкаНДС,
	|		ВТ_СводныеДанные.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|		ВТ_СводныеДанные.ДатаНачалаАренды КАК ДатаНачалаАренды,
	|		ВТ_СводныеДанные.ДатаОкончанияАренды КАК ДатаОкончанияАренды,
	|		ВТ_СводныеДанные.ДатаАктаЗаключения КАК ДатаАктаЗаключения,
	|		ВТ_СводныеДанные.СуммаПланБезналичные КАК СуммаПланБезналичные,
	|		ВТ_СводныеДанные.СуммаПланБезналичныеВал КАК СуммаПланБезналичныеВал,
	|		ВТ_СводныеДанные.СуммаПланНаличные КАК СуммаПланНаличные,
	|		ВТ_СводныеДанные.СуммаПланНаличныеВал КАК СуммаПланНаличныеВал,
	|		ВТ_СводныеДанные.ДатаОплаты КАК ДатаОплаты,
	|		ВТ_СводныеДанные.Комментарий КАК Комментарий,
	|		ВТ_СводныеДанные.ЧислоОплатыАренды КАК ЧислоОплатыАренды,
	|		ВТ_СводныеДанные.СрокОплатыАренды КАК СрокОплатыАренды,
	|		ВТ_СводныеДанные.СтатусОплаты КАК СтатусОплаты,
	|		ВТ_СводныеДанные.ТипАренднойПлаты КАК ТипАренднойПлаты,
	|		ВТ_СводныеДанные.ПлатежныйДокумент КАК ПлатежныйДокумент,
	|		ВТ_СводныеДанные.ЭтоХвостОплаты КАК ЭтоХвостОплаты,
	|		МАКСИМУМ(КурсыВалютДляРасчетовПоАренде.Период) КАК Период
	|	ИЗ
	|		ВТ_СводныеДанные КАК ВТ_СводныеДанные
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовПоАренде КАК КурсыВалютДляРасчетовПоАренде
	|			ПО ВТ_СводныеДанные.ДоговорКонтрагента = КурсыВалютДляРасчетовПоАренде.ДоговорКонтрагента
	|				И (КурсыВалютДляРасчетовПоАренде.Период <= ВТ_СводныеДанные.ДатаОплаты)
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТ_СводныеДанные.Организация,
	|		ВТ_СводныеДанные.Контрагент,
	|		ВТ_СводныеДанные.ДоговорКонтрагента,
	|		ВТ_СводныеДанные.СтавкаНДС,
	|		ВТ_СводныеДанные.СтруктурнаяЕдиница,
	|		ВТ_СводныеДанные.ДатаНачалаАренды,
	|		ВТ_СводныеДанные.ДатаОкончанияАренды,
	|		ВТ_СводныеДанные.ДатаАктаЗаключения,
	|		ВТ_СводныеДанные.ДатаОплаты,
	|		ВТ_СводныеДанные.Комментарий,
	|		ВТ_СводныеДанные.СтатусОплаты,
	|		ВТ_СводныеДанные.ТипАренднойПлаты,
	|		ВТ_СводныеДанные.ПлатежныйДокумент,
	|		ВТ_СводныеДанные.ЭтоХвостОплаты,
	|		ВТ_СводныеДанные.СрокОплатыАренды,
	|		ВТ_СводныеДанные.СуммаПланБезналичные,
	|		ВТ_СводныеДанные.СуммаПланБезналичныеВал,
	|		ВТ_СводныеДанные.СуммаПланНаличные,
	|		ВТ_СводныеДанные.СуммаПланНаличныеВал,
	|		ВТ_СводныеДанные.ЧислоОплатыАренды) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовПоАренде КАК КурсыВалютДляРасчетовПоАренде
	|		ПО ВложенныйЗапрос.ДоговорКонтрагента = КурсыВалютДляРасчетовПоАренде.ДоговорКонтрагента
	|			И ВложенныйЗапрос.Период = КурсыВалютДляРасчетовПоАренде.Период
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.ДоговорКонтрагента,
	|	ВложенныйЗапрос.ТипАренднойПлаты
	|АВТОУПОРЯДОЧИВАНИЕ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТПроизводственныйКалендарь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Статусы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Договоры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_СводныеДанные";
	
	Возврат Запрос.Выполнить();

	

КонецФункции

Функция ПолучитьРезультатТаблицуСтарыйВариант() Экспорт 
	
	РезультатЗапроса = ПолучитьРезультатЗапросаСтарыйВариант();
	
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

Функция ПолучитьРезультатВыборкуСтарыйВариант() Экспорт 
	
	РезультатЗапроса = ПолучитьРезультатЗапросаСтарыйВариант();
	
	Возврат РезультатЗапроса.Выбрать();
	
КонецФункции	

мВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
